package daily_Algorithm;

/*
 *  2020. 10. 16 Daily Algorithm 
 *  Day18 - baekjoon 단계별 문제풀이 문제번호 15596, 4673
 * 	정수 N개의 합, 셀프 넘버
 * 
 * 
 */


public class Day19_20201017 {

	// 20201017 알고리즘 풀이는 파이썬 알고리즘 강의 문제로 대체
	// 프로그래머스 - 어서와! 자료구조와 알고리즘은 처음이지?
	// Part.3 배열 더 알아보기 : 정렬과 탐색 실습문제
	// 이진 탐색 구현해보기
	
	// https://programmers.co.kr/learn/courses/57 - 강의 링크
	// github 링크
	// https://github.com/nullsector12/Python-Introduction/blob/main/Python_Algorithm/part3.SortAndSearch.py
	
	
	
	/*
	 * 문제 설명 리스트 L 과, 그 안에서 찾으려 하는 원소 x 가 인자로 주어질 때, 
	 * x 와 같은 값을 가지는 원소의 인덱스를 리턴하는 함수 solution() 을 완성하세요. 
	 * 만약 리스트 L 안에 x 와 같은 값을 가지는 원소가 존재하지 않는 경우에는 -1 을 리턴합니다.
	 * 리스트 L 은 자연수 원소들로 이루어져 있으며, 크기 순으로 정렬되어 있다고 가정합니다. 
	 * 또한, 동일한 원소는 두 번 이상 나타나지 않습니다.
	 * 
	 * 예를 들어, L = [2, 3, 5, 6, 9, 11, 15] x = 6 의 인자들이 주어지면, 
	 * L[3] == 6 이므로 3 을 리턴해야 합니다.
	 * 
	 * 또 다른 예로, L = [2, 5, 7, 9, 11] x = 4 로 주어지면, 
	 * 리스트 L 내에 4 의 원소가 존재하지 않으므로 -1 을 리턴해야 합니다.
	 * 
	 * 이 연습문제에서는 알고리즘의 효율성도 평가합니다. 
	 * 만약 순차 (선형) 탐색 알고리즘을 구현하는 경우에는 제한 시간 요구사항을 만족하지 못하여 
	 * 효율성 테스트 케이스들을 통과하지 못할 수도 있습니다.
	 */
	
}